counter = 0 #установим счетчик - это начальное значение переменной для дальнейших вычислений
while counter != 10:  #это заголовок цикла, указываем до наступления какого события будет работать цикл.
 #В данном случае цикл будет запускаться, пока счетчик не достигнет значения 9, потому что это числоо макисмально
 #близко к значению "не равно 10".
    print(counter * 4) #выводим значения умножения каждого числа из диапазона 0-9 на три
    counter = counter + 2 #указываем, что каждое следующее значение для цикла больше исходного счетчика на 1
print("Цикл завершен") #финальное сообщение системы после завершения цикла.

