user_line =  input()
# comp_line1 = " раз \n два \n три \n четыре \n пять"
# comp_line2 = ' раз \n два \n три \n четыре \n пять \n "12345" ' #строка в строке
# comp_line3 = str(346325372) #присваивает числу тип данных - строка (текст)
#
# #comp_line1[1] = "б" #так не получится сделать, поскольку строки не поддердивают замену символов в строке по индексу
# #comp_line1 = "пятюня" #зато можно полностью заменить строку на другую
# comp_line1 = comp_line1 + "\n шесть" #добавляет значение "шесть" в конец строки 1
#
#
# print(comp_line1.upper()) #все буквы строки в верхнем регистре (CapsLock)
# print(comp_line1.lower()) #все буквы строки в нижнем регистре

words = user_line.split()
symbols = list(user_line)
print(symbols)





